[
    {
        "id": "book_ea036c98fe104ccbb17991ea15005940",
        "title": "Bel Canto",
        "author": "Ann Patchett",
        "suggested_by": "Iliana",
        "summary": "Somewhere in South America, at the home of the country's vice president, a lavish birthday party is being held in honor of Mr. Hosokawa, a powerful Japanese businessman. Roxanne Coss, opera's most revered soprano, has mesmerized the international guests with her singing. It is a perfect evening—until a band of gun-wielding terrorists breaks in through the air-conditioning vents and takes the entire party hostage. But what begins as a panicked, life-threatening scenario slowly evolves into something quite different, as terrorists and hostages forge unexpected bonds and people from different countries and continents become compatriots. Without the demands of the world to shape their days, life on the inside becomes more beautiful than anything they had known before. At once riveting and impassioned, the narrative becomes a moving exploration of how people communicate when music is the only common language. Friendship, compassion, and the chance for great love lead the characters to forget the real danger that has been set in motion and cannot be stopped. Ann Patchett has written a novel that is as lyrical and profound as it is unforgettable. Bel Canto engenders in the reader the very passion for art and the language of music that its characters discover. As a reader, you find yourself fervently wanting this captivity to continue forever, even though you know that real life waits on the other side of the garden wall. A virtuoso performance by one of our best and most important writers, Bel Canto is a novel to be cherished.",
        "page_count": 335,
        "published_date": "2001-05-22",
        "cover_image_url": "http://books.google.com/books/content?id=zl428tiTsA4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "id": "book_1d00ae78faf043bcbd97e5361bf6016c",
        "title": "The Bog Wife",
        "author": "Kay Chronister",
        "suggested_by": "Emily",
        "summary": "\"A lush, beautifully written novel about trying to be a person in our strange world . . . Pick this one up for its exquisite characterization, decaying settings and a dash of Southern gothic horror.\" —Kiersten White, The New York Times Book Review A “haunting, brilliant” Appalachian folktale evoking the Southern gothic suspense of Sharp Objects and the eco spine-tinglers of Jeff Vandermeer (Paul Tremblay, author of A Head Full of Ghosts) Five siblings in West Virginia unearth long-buried secrets when the supernatural bargain entwining their fate with their ancestral land is suddenly ruptured Since time immemorial, the Haddesley family has tended the cranberry bog. In exchange, the bog sustains them. The staunch seasons of their lives are governed by a strict covenant that is renewed each generation with the ritual sacrifice of their patriarch, and in return, the bog produces a “bog-wife.” Brought to life from vegetation, this woman is meant to carry on the family line. But when the bog fails—or refuses—to honor the bargain, the Haddesleys, a group of discordant siblings still grieving the mother who mysteriously disappeared years earlier, face an unknown future. Middle child Wenna, summoned back to the dilapidated family manor just as her marriage is collapsing, believes the Haddesleys must abandon their patrimony. Her siblings are not so easily persuaded. Eldest daughter Eda, de facto head of the household, seeks to salvage the compact by desecrating it. Younger son Percy retreats into the wilderness in a dangerous bid to summon his own bog-wife. And as youngest daughter Nora takes desperate measures to keep her warring siblings together, fledgling patriarch Charlie uncovers a disturbing secret that casts doubt over everything the family has ever believed about itself. At once a gothic eco-horror, a psychological drama, and a family saga, The Bog Wife is a propulsive read for fans of Shirley Jackson, Karen Russell, and Matt Bell that speaks to what is knowable and unknowable within a family history and how to know when it is time to move forward.",
        "page_count": 242,
        "published_date": "2024-10-01",
        "cover_image_url": "http://books.google.com/books/content?id=mXLvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
        "id": "book_3",
        "title": "Circe",
        "author": "Madeline Miller",
        "suggested_by": "Charlie",
        "summary": "Di istana Helios, dewa matahari, lahir seorang anak perempuan. Tetapi Circe anak yang aneh––tidak berkuasa seperti ayahnya, juga tidak memikat seperti ibunya. Karena tak punya teman, Circe mencarinya di dunia manusia, dan mengembangkan kemampuannya sebagai penyihir. Zeus, yang merasa terancam, mengasingkannya ke pulau terpencil. Circe mengasah bakatnya dan bertemu banyak tokoh paling termasyhur dalam mitologi, di antaranya Minotaur, Daedalus dan Icarus, Medea, dan Odysseus yang lihai. Tetapi wanita yang hanya sendirian menghadapi banyak bahaya, dan Circe tanpa sengaja membangkitkan murka manusia dan dewa-dewa, sehingga mesti berhadapan dengan dewa Olympus yang paling menakutkan dan pendendam. Untuk melindungi apa yang paling dicintainya, Circe harus mengerahkan seluruh kekuatannya dan memilih dengan tegas, apakah hendak berpihak kepada dewa-dewa yang telah melahirkannya, atau manusia yang telanjur disayanginya.",
        "page_count": 546,
        "published_date": "2019-04-22",
        "cover_image_url": "http://books.google.com/books/content?id=GrGdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
]