[
    {
        "id": "book_1d00ae78faf043bcbd97e5361bf6016c",
        "title": "The Bog Wife",
        "author": "Kay Chronister",
        "suggested_by": "Emily",
        "published_date": "2024-10-01",
        "cover_image_url": "http://books.google.com/books/content?id=mXLvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "summary": "\"A lush, beautifully written novel about trying to be a person in our strange world . . . Pick this one up for its exquisite characterization, decaying settings and a dash of Southern gothic horror.\" —Kiersten White, The New York Times Book Review A “haunting, brilliant” Appalachian folktale evoking the Southern gothic suspense of Sharp Objects and the eco spine-tinglers of Jeff Vandermeer (Paul Tremblay, author of A Head Full of Ghosts) Five siblings in West Virginia unearth long-buried secrets when the supernatural bargain entwining their fate with their ancestral land is suddenly ruptured Since time immemorial, the Haddesley family has tended the cranberry bog. In exchange, the bog sustains them. The staunch seasons of their lives are governed by a strict covenant that is renewed each generation with the ritual sacrifice of their patriarch, and in return, the bog produces a “bog-wife.” Brought to life from vegetation, this woman is meant to carry on the family line. But when the bog fails—or refuses—to honor the bargain, the Haddesleys, a group of discordant siblings still grieving the mother who mysteriously disappeared years earlier, face an unknown future. Middle child Wenna, summoned back to the dilapidated family manor just as her marriage is collapsing, believes the Haddesleys must abandon their patrimony. Her siblings are not so easily persuaded. Eldest daughter Eda, de facto head of the household, seeks to salvage the compact by desecrating it. Younger son Percy retreats into the wilderness in a dangerous bid to summon his own bog-wife. And as youngest daughter Nora takes desperate measures to keep her warring siblings together, fledgling patriarch Charlie uncovers a disturbing secret that casts doubt over everything the family has ever believed about itself. At once a gothic eco-horror, a psychological drama, and a family saga, The Bog Wife is a propulsive read for fans of Shirley Jackson, Karen Russell, and Matt Bell that speaks to what is knowable and unknowable within a family history and how to know when it is time to move forward.",
        "page_count": 242,
        "categories": [
            "Fiction"
        ],
        "publisher": "Catapult"
    },
    {
        "id": "book_93ac127b0f494379803fd0e5b1920355",
        "title": "Circe",
        "author": "Madeline Miller",
        "suggested_by": "Amy",
        "published_date": "2018-02-20",
        "cover_image_url": "http://books.google.com/books/content?id=qZRODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "summary": "\"A bold and subversive retelling of the goddess's story,\" this #1 New York Times bestseller is \"both epic and intimate in its scope, recasting the most infamous female figure from the Odyssey as a hero in her own right\" (Alexandra Alter, The New York Times). In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child -- not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power -- the power of witchcraft, which can transform rivals into monsters and menace the gods themselves. Threatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in all of mythology, including the Minotaur, Daedalus and his doomed son Icarus, the murderous Medea, and, of course, wily Odysseus. But there is danger, too, for a woman who stands alone, and Circe unwittingly draws the wrath of both men and gods, ultimately finding herself pitted against one of the most terrifying and vengeful of the Olympians. To protect what she loves most, Circe must summon all her strength and choose, once and for all, whether she belongs with the gods she is born from, or the mortals she has come to love. With unforgettably vivid characters, mesmerizing language, and page-turning suspense, Circe is a triumph of storytelling, an intoxicating epic of family rivalry, palace intrigue, love and loss, as well as a celebration of indomitable female strength in a man's world. #1 New York Times Bestseller -- named one of the Best Books of the Year by NPR, the Washington Post, People, Time, Amazon, Entertainment Weekly, Bustle, Newsweek, the A.V. Club, Christian Science Monitor, Refinery 29, Buzzfeed, Paste, Audible, Kirkus, Publishers Weekly, Thrillist, NYPL, Self, Real Simple, Goodreads, Boston Globe, Electric Literature, BookPage, the Guardian, Book Riot, Seattle Times, and Business Insider.",
        "page_count": 32,
        "categories": [
            "Fiction"
        ],
        "publisher": "Little, Brown"
    },
    {
        "id": "book_ea036c98fe104ccbb17991ea15005940",
        "title": "Bel Canto",
        "author": "Ann Patchett",
        "suggested_by": "Iliana",
        "published_date": "2001-05-22",
        "cover_image_url": "http://books.google.com/books/content?id=zl428tiTsA4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "summary": "Somewhere in South America, at the home of the country's vice president, a lavish birthday party is being held in honor of Mr. Hosokawa, a powerful Japanese businessman. Roxanne Coss, opera's most revered soprano, has mesmerized the international guests with her singing. It is a perfect evening—until a band of gun-wielding terrorists breaks in through the air-conditioning vents and takes the entire party hostage. But what begins as a panicked, life-threatening scenario slowly evolves into something quite different, as terrorists and hostages forge unexpected bonds and people from different countries and continents become compatriots. Without the demands of the world to shape their days, life on the inside becomes more beautiful than anything they had known before. At once riveting and impassioned, the narrative becomes a moving exploration of how people communicate when music is the only common language. Friendship, compassion, and the chance for great love lead the characters to forget the real danger that has been set in motion and cannot be stopped. Ann Patchett has written a novel that is as lyrical and profound as it is unforgettable. Bel Canto engenders in the reader the very passion for art and the language of music that its characters discover. As a reader, you find yourself fervently wanting this captivity to continue forever, even though you know that real life waits on the other side of the garden wall. A virtuoso performance by one of our best and most important writers, Bel Canto is a novel to be cherished.",
        "page_count": 335,
        "categories": [
            "Fiction"
        ],
        "publisher": "Harper Collins"
    },
    {
        "id": "book_7eeb46",
        "title": "Not Quite Dead Yet",
        "author": "Holly Jackson",
        "suggested_by": "Holly",
        "published_date": "2025-07-22",
        "cover_image_url": "http://books.google.com/books/content?id=9FkoEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "summary": "From the#1 New York Times bestselling author of A Good Girl's Guide to Murder. The stunning hardcover of Not Quite Dead features a custom-stamped case, beautiful endpapers, and a premium dust jacket! In seven days Jet Mason will be dead. Jet is the daughter of one of the wealthiest families in Woodstock, Vermont. Twenty-seven years old, and back living with her parents, she's still waiting for her life to begin. I'll do it later, she always says. She has time. Until Halloween night, when she is violently attacked by an unseen intruder, suffering a catastrophic head injury. Doctors are certain that within a week, the injury will trigger a deadly aneurysm. Jet never thought of herself as having enemies. But now she looks at everyone in a new light: her family, her former best friend turned sister-in-law, her ex-boyfriend. She has at most seven days, and as her condition deteriorates she has only her childhood friend Billy for help. But nevertheless, she's absolutely determined to finally finish something: Jet is going to solve her own murder.",
        "page_count": 417,
        "categories": [
            "Fiction"
        ],
        "publisher": "Doubleday Canada"
    },
    {
        "id": "book_15b95e",
        "title": "Exiles",
        "author": "Mason Coiles",
        "suggested_by": "Mason",
        "published_date": "2025-09-16",
        "cover_image_url": "http://books.google.com/books/content?id=H688EQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "summary": "A terrifying locked-room mystery from the author of William--this time set on a remote outpost on Mars. The human crew sent to prepare the first colony on Mars arrives to find the new base half-destroyed and the three robots sent to set it up in disarray—the machines have formed alliances, chosen their own names, and picked up some disturbing beliefs. Each must be interrogated. But one of them is missing. In this barren, hostile landscape where even machines have nightmares, the astronauts will need to examine all the stories--especially their own--to get to the truth. Exiles is a terrifying, taut, one-sitting read, and Mason Coile once again blends science fiction and psychological horror to engage some of humanity’s deepest questions.",
        "page_count": 225,
        "categories": [
            "Fiction"
        ],
        "publisher": "Penguin Group"
    }
]